Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: A property with a default value is not implicitly optional. If a non-optional configuration item with a default value is explicitly specified to have an empty value, the application will report a configuration error and will not start. If it is desired for a property to have a default value and also be optional, it must have an `Optional` type as described above.
ja_jp: デフォルト値を持つプロパティーは暗黙的にはオプションではありません。デフォルト値を持つオプション以外の設定項目に対して空の値を持つよう明示的に指定した場合、アプリケーションは設定エラーを報告し、起動しません。プロパティーにデフォルト値を持たせ、オプションにするには、上記のように `Optional` タイプが必要です。

source: A property with dashes `foo.bar-baz`, replace each character that is neither alphanumeric nor `\_` with `_`: `FOO_BAR_BAZ`
ja_jp: ダッシュを含むプロパティ `foo.bar-baz` の場合、英数字でも `_` でもない各文字を `_` で置換します: `FOO_BAR_BAZ`

source: A property with double quotes `foo."bar".baz`, replace each character that is neither alphanumeric nor `\_` with `_`: `FOO\__BAR__BAZ`
ja_jp: 二重引用符で囲まれたプロパティ `foo."bar".baz` の場合、英数字でも `_` でもない各文字を `_` で置換します: `FOO__BAR__BAZ`

source: A provided file URI. The file URI can also be a file under resources
ja_jp: 提供されたファイルURI。ファイル URI は、'resources' 配下のファイルを指すこともできます。

source: A proxy acts as an intermediary between an application and external services. Instead of connecting directly to a remote host, the application sends requests through a proxy server. The proxy server then forwards the requests to the destination.
ja_jp: プロキシーは、アプリケーションと外部サービスの間で仲介役として機能します。アプリケーションは、リモートホストに直接接続する代わりに、プロキシーサーバーを経由してリクエストを送信します。その後、プロキシーサーバーはリクエストを宛先に転送します。

source: A qualifier type is a Java annotation defined as `@Retention(RUNTIME)` and annotated with the `@jakarta.inject.Qualifier` meta-annotation:
ja_jp: 修飾子型は、 `@Retention(RUNTIME)` として定義され、 `@jakarta.inject.Qualifier` メタアノテーションでアノテーションされた Java アノテーションです:

source: A qualifier type is a Java annotation defined as `@Retention(RUNTIME)` and annotated with the `@javax.inject.Qualifier` meta-annotation:
ja_jp: Qualifier型は、 `@Retention(RUNTIME)` として定義された Java アノテーションで、 `@javax.inject.Qualifier` メタアノテーションでアノテーションされています。

source: A query created with the help of static metamodel may look as:
ja_jp: 静的メタモデルを使用して作成されたクエリーは、次のようになります。

source: A quick and easy way to generate and access Qute templates is through CodeLens support. The `qute.codeLens.enabled` setting controls whether the Qute CodeLens is visible.
ja_jp: Quteのテンプレートを生成したり、アクセスするための迅速で簡単な方法は、CodeLensのサポートを利用することです。 `qute.codeLens.enabled` 設定は、Qute CodeLens を表示するかどうかを制御します。

source: A reactive MongoDB Client is included in Quarkus. Using it is as easy as using the classic MongoDB Client. You can rewrite the previous example to use it like the following.
ja_jp: リアクティブなMongoDBクライアントがQuarkusに含まれています。これを使うのは、古典的なMongoDBクライアントを使うのと同じくらい簡単です。先ほどの例を以下のように書き換えて使うことができます。

source: A reactive client for the MySQL database
ja_jp: MySQL データベース用のリアクティブクライアント

source: A reactive client for the PostgreSQL database
ja_jp: PostgreSQL データベース用のリアクティブクライアント

source: A reactive route can return a `Multi`. The items are written one by one, in the response. The response `Transfer-Encoding` header is set to `chunked`.
ja_jp: Reactive Routesは `Multi` を返すことができます。レスポンスでは、項目が 1 つずつ書き込まれます。レスポンスの `Transfer-Encoding` ヘッダーは `chunked` に設定されます。

source: A recap of Quarkus Tools for IntelliJ's latest improvements
ja_jp: Quarkus Tools for IntelliJの最新改良点のまとめ

source: A recommended development set-up is to have some producer which creates test messages on the processed topic(s) in fixed intervals, e.g. every second and observe the streaming application's output topic(s) using a tool such as `kafkacat`. Using the dev mode, you'll instantly see messages on the output topic(s) as produced by the latest version of your streaming application when saving.
ja_jp: 推奨される開発セットアップは、処理されたトピックに対して一定の間隔 (たとえば毎秒) でテストメッセージを作成するプロデューサを用意し、 `kafkacat` のようなツールを使用してストリーミング アプリケーションの出力トピックを観察することです。開発モードを使用すると、保存時にストリーミングアプリケーションの最新バージョンによって生成された出力トピッ ク上のメッセージを即座に見ることができます。

source: A recorder consuming a `MetricsFactory` can use `MetricsFactory::metricsSystemSupported()` can be used to control initialization of metrics objects during bytecode recording in a similar way.
ja_jp: `MetricsFactory` を使用するレコーダーは `MetricsFactory::metricsSystemSupported()` を使用して、同様の方法でバイトコード記録中にメトリクスオブジェクトの初期化を制御できます。

source: A regular expression `foo.*` disables validation for templates whose name is starting with `foo`.
ja_jp: 正規表現 `foo.*` は、名前が `foo` で始まるテンプレートのバリデーションを無効にします。

source: A repository fragment is defined as so:
ja_jp: リポジトリーフラグメントは次のように定義されます。

source: A request is sent to the OIDC provider `UserInfo` endpoint by using the access token returned with the authorization code grant response, and an `io.quarkus.oidc.UserInfo` (a simple `jakarta.json.JsonObject` wrapper) object is created. `io.quarkus.oidc.UserInfo` can be injected or accessed as a SecurityIdentity `userinfo` attribute.
ja_jp: 認可コードの付与応答で返されたアクセストークンを使用して、OIDC プロバイダーの `UserInfo` エンドポイントにリクエストが送信され、 `io.quarkus.oidc.UserInfo` (単純な `jakarta.json.JsonObject` ラッパー) オブジェクトが作成されます。 `io.quarkus.oidc.UserInfo` は、SecurityIdentity `userinfo` 属性として注入またはアクセスできます。

source: A request will be sent to the OpenID Provider UserInfo endpoint using the access token returned with the authorization code grant response and an `io.quarkus.oidc.UserInfo` (a simple `jakarta.json.JsonObject` wrapper) object will be created. `io.quarkus.oidc.UserInfo` can be either injected or accessed as a SecurityIdentity `userinfo` attribute.
ja_jp: 認可コードグラントのレスポンスで返されるアクセストークンを使ってOpenID Provider UserInfoエンドポイントにリクエストが送られ、 `io.quarkus.oidc.UserInfo` （シンプルな `jakarta.json.JsonObject` ラッパー）オブジェクトが作成されます。 `io.quarkus.oidc.UserInfo` はSecurityIdentity `userinfo` attributeとして注入またはアクセスすることができます。

source: A request will be sent to the OpenID Provider UserInfo endpoint using the access token returned with the authorization code grant response and an `io.quarkus.oidc.UserInfo` (a simple `javax.json.JsonObject` wrapper) object will be created. `io.quarkus.oidc.UserInfo` can be either injected or accessed as a SecurityIdentity `userinfo` attribute.
ja_jp: リクエストは、認可コードグラント応答で返されたアクセストークンを使用して OpenID プロバイダー UserInfo エンドポイントに送信され、 `io.quarkus.oidc.UserInfo` (単純な `javax.json.JsonObject` ラッパー) オブジェクトが作成されます。 `io.quarkus.oidc.UserInfo` は、SecurityIdentity `userinfo` 属性として挿入またはアクセスできます。

source: A resource is data exposed by your extension. There are two ways to create a resource.
ja_jp: リソースとは、エクステンションによって公開されるデータのことです。リソースを作成するには 2 つの方法があります。

source: A resource tag, similar to a hash code of the resource to designate its state or version
ja_jp: リソースの状態またはバージョンを指定するためのリソースのハッシュコードに似たリソースタグ

source: A responsive frontend that integrates tightly with hot reload
ja_jp: ホットリロードと密接に統合されたレスポンシブなフロントエンド

source: A responsive system can continue to handle the request while facing failures and under fluctuating load. Quarkus has been tailored for that. It provides features that will help you design, implement and operate reactive systems.
ja_jp: レスポンシブなシステムは、障害に直面しても、負荷が変動しても、リクエストを処理し続けることができます。Quarkusはそのために調整されています。リアクティブなシステムの設計、実装、運用に役立つ機能を備えています。

source: A rich and cohesive ecosystem
ja_jp: リッチでまとまりのあるエコシステム

source: A room can have at most one lesson at the same time.
ja_jp: 教室は同時に最大 1 つのレッスンを持つことができます。

source: A route method can accept arguments of the following types:
ja_jp: ルートメソッドは、次のタイプの引数を受け取ることができます。

source: A route method must be a non-private non-static method of a CDI bean. If the annotated method returns `void` then it has to accept at least one argument - see the supported types below. If the annotated method does not return `void` then the arguments are optional.
ja_jp: ルートメソッドは、CDIBean の非プライベート非静的メソッドでなければなりません。アノテーションされたメソッドが `void` を返す場合は、少なくとも 1 つの引数を受け入れる必要があります。以下はサポート対象のタイプです。アノテーションされたメソッドが `void` を返さない場合、引数はオプションになります。

source: A rule unit is a new concept introduced in Drools encapsulating both a set of rules and the facts against which those rules will be matched. It comes with a second abstraction called data source, defining the sources through which the facts are inserted, acting in practice as typed entry-points. There are two types of data sources:
ja_jp: ルールユニットは、ルールセットとそれらのルールが照合されるファクトの両方をカプセル化する、Drools で導入された新しい概念です。これには、ファクトが挿入されるソースを定義するデータソースと呼ばれる 2 番目の抽象化が付属しており、実際には型付きエントリーポイントとして機能します。データソースには 2 つの種類があります。

source: A running Artemis server, or Docker to start one
ja_jp: 実行中のArtemisサーバー、またはDockerでの起動

source: A running Redis server, or Docker Compose to start one
ja_jp: 実行中のRedisサーバー、または1つ起動するためのDocker Compose

source: A running link:https://cassandra.apache.org[Apache Cassandra], link:https://www.datastax.fr/products/datastax-enterprise[DataStax Enterprise] (DSE) or link:https://astra.datastax.com[DataStax Astra] database; or alternatively, a fresh Docker installation.
ja_jp: 稼働中の link:https://cassandra.apache.org[Apache Cassandra]、 link:https://www.datastax.fr/products/datastax-enterprise[DataStax Enterprise]（DSE）、または link:https://astra.datastax.com[DataStax Astra]データベース、あるいはきれいなDockerのインストール

source: A runtime module that contains the logic to execute the generated queries.
ja_jp: 生成されたクエリーを実行するためのロジックを含む実行時モジュール。

source: A runtime submodule that contains the runtime behavior that will provide the extension behavior in the native executable or runtime JVM.
ja_jp: ネイティブ実行可能ファイルまたはランタイムJVMでエクステンション動作を提供する実行時動作を含むランタイムサブモジュール

source: A sample configuration for DataStax Astra should look like this:
ja_jp: DataStax Astraのサンプル構成は次のようになります。

source: A sample configuration should look like this:
ja_jp: 設定のサンプルは以下のようになります。

source: A scheduled job was paused.
ja_jp: スケジュールされたジョブが一時停止されました。

source: A scheduled job was resumed.
ja_jp: スケジュールされたジョブが再開されました。

source: A second component (`aggregator`) reads from the two Kafka topics and processes them in a streaming pipeline:
ja_jp: 2 つ目のコンポーネント ( `aggregator` ) は、2 つの Kafka トピックから読み込み、ストリーミングパイプラインで処理します:

source: A second level `Prerequistes` heading should immediately follow the extension status box in your document preview. It should state:
ja_jp: 第 2 レベルの `Prerequistes` 見出しは、ドキュメントプレビューのエクステンションステータスボックスの直後に表示される必要があります。これには、以下を記載する必要があります。

source: A secret (such as a password, a personal access token or an API key) must not end up in version control for security reasons. One way is to store them in a local environment properties (`.env`) file:
ja_jp: シークレット（パスワード、個人用アクセストークン、APIキーなど）は、セキュリティ上の理由から、バージョン管理には置いてはいけません。 一つの方法は、ローカル環境のプロパティ ( `.env` ) ファイルに保存することです:

source: A secret configuration may be expressed as `${handler::value}`, where the `handler` is the name of a `io.smallrye.config.SecretKeysHandler` to decode or decrypt the `value`.
ja_jp: シークレット設定は、 `${handler::value}` のように表現できます。 `handler` は、 `value` をデコードまたは復号化するための `io.smallrye.config.SecretKeysHandler` の名前です。

source: A secret configuration may be expressed as `${handler::value}`, where the `handler` is the name of a `io.smallrye.config.SecretKeysHandler` to decode or decrypt the `value`. Consider:
ja_jp: シークレット設定は、 `${handler::value}` と表現することができます。 `handler` は、 `value` を解読または復号するための `io.smallrye.config.SecretKeysHandler` の名前です :

source: A section has a start tag that starts with `#`, followed by the name of the section such as `{#if}` and `{#each}`. It may be empty, i.e. the start tag ends with `/`: `{#myEmptySection /}`. Sections usually contain nested expressions and other sections. The end tag starts with `/` and contains the name of the section (optional): `{#if foo}Foo!{/if}` or `{#if foo}Foo!{/}`.
ja_jp: セクションは `#` で始まる開始タグを持ち、その後に `{#if}` や `{#each}` のようなセクション名が続きます。また、空であっても構いません。つまり、開始タグは `/` で終了します: `{#myEmptySection /}`。セクションは通常、ネストされた式や他のセクションを含んでいます。終了タグは `/` で始まり、セクションの名前 (オプション) を含みます。 `{#if foo}Foo!{/if}または `{#if foo}Foo!{/}`

source: A section has a start tag that starts with `#`, followed by the name of the section such as `{#if}` and `{#each}`. It may be empty, i.e. the start tag ends with `/`: `{#myEmptySection /}`. Sections usually contain nested expressions and other sections. The end tag starts with `/` and contains the name of the section (optional): `{#if foo}Foo!{/if}` or `{#if foo}Foo!{/}`. Some sections support optional end tags, i.e. if the end tag is missing then the section ends where the parent section ends.
ja_jp: セクションは `#` で始まる開始タグを持ち、その後に `{#if}` や `{#each}` のようなセクション名が続きます。 また、空でも構いません。その場合、開始タグは `/` で終了します (`{#myEmptySection /}`)。 セクションには通常、ネストされた式や他のセクションが含まれています。 終了タグは `/` で始まり、セクションの名前 (オプション) が含まれます (`{#if foo}Foo!{/if}または `{#if foo}Foo!{/}`)。 一部のセクションではオプションの終了タグがサポートされています。終了タグがない場合、セクションは親セクションの終了位置で終了します。

source: A section may contain several content *blocks*. The "main" block is always present. Additional/nested blocks also start with `#` and can have parameters too - `{#else if item.isActive}`. A section helper that defines the logic of a section can "execute" any of the blocks and evaluate the parameters.
ja_jp: 1つのセクションには、いくつかのコンテンツ *ブロック* を含めることができます。 "main" ブロックは常に存在します。 追加/入れ子になったブロックも `#` で始まり、パラメーターを持つことができます (`{#else if item.isActive}`)。 セクションのロジックを定義するセクションヘルパーは、任意のブロックを「実行」し、パラメーターを評価することができます。

source: A section:
ja_jp: セクションは:

source: A service binding process starts with a user specification of required services that will be bound to a certain application. This expression is summarized in the `ServiceBinding` resource that is generated by the `kubernetes-service-binding` extension. The use of the `kubernetes-service-binding` extensions helps users to generate `ServiceBinding` resources with minimal configuration, therefore simplifying the process overall.
ja_jp: サービスバインディングのプロセスは、あるアプリケーションにバインドされる必要なサービスをユーザーが指定するところから始まります。この表現は、`kubernetes-service-binding` エクステンションによって生成される `ServiceBinding` リソースに要約されています。`kubernetes-service-binding` エクステンションを使用することで、ユーザーは最小限の設定で `ServiceBinding` リソースを生成できるため、プロセス全体が簡素化されます。

source: A session cookie encryption secret can be configured with `quarkus.oidc.token-state-manager.encryption-secret`. Quarkus OIDC fallbacks to the configured client secret if the encryption secret is not configured, and, if the client secret is also not available (for example, when the JWT `private_key_jwt` or MTLS client authentication method is used) - generates a secure random secret itself. Be aware that generating an encryption secret can cause re-authentication failures in a multi-pod container deployment where one pod may not be able to decrypt a session cookie encrypted by the secret known to another pod only.
ja_jp: セッション Cookie の暗号化シークレットは `quarkus.oidc.token-state-manager.encryption-secret` で設定できます。Quarkus OIDC は、暗号化シークレットが設定されていない場合は設定済みのクライアントシークレットにフォールバックし、クライアントシークレットも利用できない場合 (例: JWT `private_key_jwt` または MTLS クライアント認証方式が使用されている場合) は、自身でセキュアなランダムシークレットを生成します。暗号化シークレットを自動生成すると、あるポッドで暗号化されたセッション Cookie を別のポッドが復号できない可能性があるため、マルチポッド構成のコンテナーデプロイメントにおいて再認証エラーが発生する原因となる可能性があることに注意してください。

source: A set of _bookies_ used for persistent storage of messages.
ja_jp: メッセージの永続的な保存に使用される _bookies_ のセット。

source: A short explanation of what the extension does or enables.
ja_jp: エクステンションが何をするのか、または何を有効にするのかについての短い説明。

source: A shortcut to the configuration editor filtered to settings relevant to this extension.
ja_jp: このエクステンションに関連する設定にフィルタリングされた設定エディターへのショートカット。

source: A shorter scope ensures that instances created after a certificate reload use the latest certificate.
ja_jp: スコープを短くすることで、証明書の再読み込み後に作成されたインスタンスが最新の証明書を使用するようにします。

source: A significant disruption in a request or the inability to service a request.
ja_jp: リクエストの大幅な中断、またはリクエストに対応できないこと

source: A similar mechanism exists for GraphQL services based on the `quarkus-smallrye-graphql` extension.
ja_jp: 同様の仕組みは、 `quarkus-smallrye-graphql` エクステンションに基づく GraphQL サービスにも存在します。

source: A similar process applies for other meter registry extensions. To use the Micrometer StackDriver MeterRegistry, for example, you would use the `quarkus-micrometer-registry-stackdriver` extension from the Quarkiverse:
ja_jp: 他のメーターレジストリーエクステンションにも同様のプロセスが適用されます。 たとえば、Micrometer StackDriver MeterRegistry を使用するには、 Quarkiverse の `quarkus-micrometer-registry-stackdriver` エクステンションを使用します。

source: A similar technique can be used with `TenantConfigResolver` where a `tenant-id` provided in the context can be used to return `OidcTenantConfig` already prepared with the previous request.
ja_jp: 同様の手法は、 `TenantConfigResolver` でも使用できます。コンテキストで提供される `tenant-id` を使用して、前のリクエストで既に用意された `OidcTenantConfig` を返すことができます。

source: A similar technique can be used with `TenantConfigResolver`, where a `tenant-id` provided in the context can return `OidcTenantConfig` already prepared with the previous request.
ja_jp: 同様の手法を `TenantConfigResolver` でも使用できます。コンテキストで提供される `tenant-id` は、以前のリクエストですでに準備されている `OidcTenantConfig` を返すことができます。

source: A simple Picocli application with only one `Command` can be created as follows:
ja_jp: 1 つの `Command` のみを含むシンプルな Picocli アプリケーションは、次のように作成できます。

source: A simple REST application, the one you get when you run `quarkus create app`
ja_jp: `quarkus create app` を実行したときに得られるシンプルな REST アプリケーション

source: A simple approach could be to catch the exception and return `null`, so that the caller can act accordingly:
ja_jp: シンプルなアプローチとしては、例外をキャッチして `null` を返すことで、呼び出し元がそれに応じて行動できるようにすることができます。

source: A simple augmentation of `SecurityIdentity` will be required where a principal created with the internally-generated `IdToken` will be replaced with the `UserInfo`-based principal when the GitHub flow is active:
ja_jp: GitHub フローがアクティブな場合は、内部で生成された `IdToken` で作成されたプリンシパルが `UserInfo` ベースのプリンシパルに置き換えられる、`SecurityIdentity` の単純な拡張が必要になります。

source: A simple bean like `QuarkusCqlSession` or `FruitDao`;
ja_jp: `QuarkusCqlSession` や `FruitDao` のようなシンプルなBean；

source: A simple blue service exposed on port 9000
ja_jp: 9000番ポートで公開されるシンプルなブルーサービス

source: A simple blue service.
ja_jp: シンプルな Blue サービス。

source: A simple example could be the following:
ja_jp: 簡単な例を挙げると、次のようになります:

source: A simple example is to provide a custom ObjectMapper to the REST Client Jackson extension by doing:
ja_jp: 簡単な例として、次のようにして REST Client Jackson エクステンションにカスタム ObjectMapper を提供することが挙げられます。

source: A simple example of customizing the request would be to add a custom header:
ja_jp: リクエストをカスタマイズする簡単な例として、カスタムヘッダーを追加することが挙げられます。

source: A simple example of implementing such a `ResponseExceptionMapper` for the `ExtensionsService` discussed above, could be:
ja_jp: 上記の `ExtensionsService` にこのような `ResponseExceptionMapper` を実装する簡単な例は、次のとおりです。

source: A simple example where the event payloads are `Long` values is the following:
ja_jp: イベントペイロードが `Long` 値である簡単な例を次に示します。

source: A simple operator example
ja_jp: 簡単な演算子の例

source: A simple red service exposed on port 9001
ja_jp: 9001番ポートで公開されるシンプルなレッドサービス

source: A simple red service.
ja_jp: シンプルな Red サービスです。

source: A simpler way to convert HTTP response codes of 400 or above is to use the `@ClientExceptionMapper` annotation.
ja_jp: 400 以上の HTTP 応答コードを変換する簡単な方法は、 `@ClientExceptionMapper` アノテーションを使用することです。

source: A single bean instance is used for the application and shared among all injection points. The instance is created lazily, i.e. once a method is invoked upon the <<client_proxies, client proxy>>.
ja_jp: 単一のBeanインスタンスがアプリケーションに使用され、すべてのインジェクションポイント間で共有されます。<<client_proxies, client proxy>> は遅延的に生成されます。

source: A single bean instance is used for the application and shared among all injection points. The instance is created lazily, i.e. once a method is invoked upon the xref:client_proxies[client proxy].
ja_jp: 単一のBeanインスタンスがアプリケーションに使用され，すべての注入ポイント間で共有されます。インスタンスは，遅延的に，すなわち，一旦メソッドが xref:client_proxies[クライアントプロキシ] 上で呼び出されると，生成されます。

source: A single user can have more than one authenticator device, which means a single username can map to multiple credential IDs, all of which identify the same user.
ja_jp: 1人のユーザーが複数の認証デバイスを持つことができるため、1つのユーザー名が複数のクレデンシャルIDに対応し、そのすべてが同じユーザーを識別することができます。

source: A single-page application (SPA) typically uses `XMLHttpRequest`(XHR) and the JavaScript utility code provided by the OIDC provider to acquire a bearer token to access Quarkus `service` applications.
ja_jp: シングルページアプリケーション (SPA) は、通常、 `XMLHttpRequest` (XHR) と OIDC プロバイダーが提供する JavaScript ユーティリティーコードを使用してベアラートークンを取得し、Quarkus `service` アプリケーションにアクセスします。

source: A size configuration option recognises string in this format (shown as a regular expression): `[0-9]+[KkMmGgTtPpEeZzYy]?`. If no suffix is given, assume bytes.
ja_jp: サイズ設定オプションは、次の形式（正規表現として表示）の文字列を認識します: `[0-9]+[KkMmGgTtPpEeZzYy]?` 。サフィックスが指定されていない場合は、バイトであると想定されます。

source: A slick web frontend
ja_jp: 洗練されたWebフロントエンド

source: A small part of the extension work is executed at runtime via the generated classes, while the bulk of the work is done at build time (called deployment time)
ja_jp: 拡張作業のごく一部は生成されたクラスを介して実行時に実行され、作業の大部分はビルド時に行われます (デプロイメント時と呼ばれます)

source: A special (albeit rather advanced) case where the new APIs do result in noticeably better performance is the case of `MessageBodyReader` and `MessageBodyWriter` classes. When reading the HTTP request and writing the HTTP response, the use of https://quarkus.io/guides/resteasy-reactive#readers-and-writers-mapping-entities-and-http-bodies[ServerMessageBodyReader] and `ServerMessageBodyWriter` allows RESTEasy Reactive to optimize the data-path for serving the request.
ja_jp: 新しい API によってパフォーマンスが顕著に向上する特別なケースとして、 `MessageBodyReader` と `MessageBodyWriter` クラスがあります。HTTP リクエストの読み込みと HTTP レスポンスの書き込みの際に、 link:https://quarkus.io/guides/resteasy-reactive#readers-and-writers-mapping-entities-and-http-bodies[ServerMessageBodyReader]と `ServerMessageBodyWriter` を使用することで、RESTEasy Reactive はリクエストを提供するためのデータパスを最適化することができます。

source: A special constant - `TemplateExtension#ANY` - can be used to specify that the extension method matches any name.
ja_jp: 特別な定数 - `TemplateExtension#ANY` - を使用すると、エクステンションメソッドが任意の名前にマッチするように指定することができます。

source: A special constant - `TemplateExtension#ANY`/`*` - can be used to specify that the extension method matches any name.
ja_jp: 特別な定数 - `TemplateExtension#ANY` / `*` - を使用すると、拡張メソッドが任意の名前にマッチするように指定することができます。

source: A special level to turn on logging for all messages, including custom levels.
ja_jp: カスタムレベルを含むすべてのメッセージのロギングをオンにする特別なレベル。

source: A special level to use in configuration in order to turn off logging.
ja_jp: ロギングをオフにするために設定で使用する特別なレベル。

source: A special level to use in configuration to turn on logging for all messages, including custom levels.
ja_jp: カスタム・レベルを含むすべてのメッセージのロギングを有効にするために、設定で使用する特別なレベル。

source: A special level used in configuration to turn off logging.
ja_jp: ロギングをオフにするために設定で使用される特別なレベル。

source: A specific Operator needs to be used rather than the default Operator for that service kind
ja_jp: そのサービスの kind のデフォルトの Operator ではなく、特定の Operator を使用する必要がある

source: A specific revision to which to send this portion of traffic
ja_jp: この部分のトラフィックの送信先となる特定のリビジョン
